In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r'C:\Users\Satyam\Downloads\Bengaluru_House_Data.csv')

In [7]:
df.loc[df.society == 'Coomee'].shape

(0, 9)

In [6]:
df.loc[df.society == 'Theanmp'].shape

(13, 9)

In [8]:
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,@@@@@@,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.00

In [10]:
df['society'].nunique()

2689

In [12]:
# price--->
df['price']

In [14]:
df.price.max()

3600.0

In [16]:
median_price = df.price.median()

In [35]:
# top 5 house cheapest
# top 5 house having highest price
df[df['price'] > median_price]['price'].sort_values(ascending=False).head()

13067    3600.0
11080    2912.0
13200    2800.0
11763    2736.0
3180     2700.0
Name: price, dtype: float64

In [19]:
6645*2

13290

In [20]:
df.shape[0]

13320

In [23]:
# sort_values

# task-----> find the data where the price of the house is min than the
# avg price.

In [32]:
df.nsmallest(5,['price'])

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
10526,Super built-up Area,Ready To Move,Yelahanka New Town,1 BHK,KHatsFl,284,1.0,1.0,8.00
11569,Plot Area,Immediate Possession,Hosur Road,NaN,AVeldun,1350,NaN,NaN,8.44
8594,Built-up Area,Ready To Move,Chandapura,1 BHK,NaN,450,1.0,1.0,9.00
1471,Built-up Area,18-Mar,Kengeri,1 BHK,NaN,340,1.0,1.0,10.00
4113,Super built-up Area,18-Jan,BTM Layout,3 BHK,NaN,167Sq. Meter,3.0,2.0,10.00

In [36]:
# task-----> find the data where the price of the house is min than the
# avg price.
df['price'].mean()

112.56562650150138

In [41]:
df.loc[df['price']<=df['price'].mean()]['price'].sort_values()

10526      8.00
11569      8.44
8594       9.00
1471      10.00
11091     10.00
          ...
4614     112.00
4912     112.00
1527     112.00
9429     112.00
3009     112.00
Name: price, Length: 9695, dtype: float64

In [44]:
df[df['price'] < df['price'].mean()]['price'].sort_values()

10526      8.00
11569      8.44
8594       9.00
1471      10.00
11091     10.00
          ...
4614     112.00
4912     112.00
1527     112.00
9429     112.00
3009     112.00
Name: price, Length: 9695, dtype: float64

In [59]:
# merging
# concate
# append

x = {
    'name':['A'],
    'age':[34]
}

y = {
    'salary':[45],
    'marks':[1]
}

In [60]:
x

{'name': ['A'], 'age': [34]}

In [61]:
y

{'salary': [45], 'marks': [1]}

In [62]:
pd.DataFrame(x)

  name  age
0    A   34

In [63]:
pd.DataFrame(y)

   salary  marks
0      45      1

In [67]:
df.merge(x,y,how = 'left')

TypeError: merge() got multiple values for argument 'how'

In [68]:
# concate
a = [1,2,3,4]
b = [5,6,7,8]
c = a+b
c

[1, 2, 3, 4, 5, 6, 7, 8]

In [69]:
#append
a = [23,45,89,90]
a.append('hello bhai')

In [70]:
a

[23, 45, 89, 90, 'hello bhai']

In [71]:
a = [23,45,89,90,34]
b = [-1,45,89,23,0]
a.append(b)

In [72]:
a

[23, 45, 89, 90, 34, [-1, 45, 89, 23, 0]]

In [73]:
dict1 = {
    'name':['a'],
    'age':[34],
    'hobby':['music']
}

In [74]:
dict2 = {
    'age':[45],
    'hobby':['study']
}

In [77]:
a = pd.DataFrame(dict1)

In [78]:
b = pd.DataFrame(dict2)

In [81]:
a

  name  age  hobby
0    a   34  music

In [82]:
b

   age  hobby
0   45  study

In [87]:
pd.merge(a,b,how = 'left')

  name  age  hobby
0    a   34  music

In [88]:
pd.merge(a,b,how = 'right')

  name  age  hobby
0  NaN   45  study

In [89]:
pd.merge(a,b,how = 'outer')

  name  age  hobby
0    a   34  music
1  NaN   45  study

In [91]:
pd.merge(a,b,how = 'inner')

Empty DataFrame
Columns: [name, age, hobby]
Index: []

In [92]:
pd.merge(a,b,how = 'cross')

  name  age_x hobby_x  age_y hobby_y
0    a     34   music     45   study

In [94]:
x={
        'name':['a'],
        'age':[34]
}

y={
    'age':[2845]
}

a = pd.DataFrame(x)
b = pd.DataFrame(y)

pd.merge(a,b,how='left')

  name  age
0    a   34